Repository: AhmedJardak/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: it_it

source: Use the palette on the left to drag and drop containers and widgets in the whiteboard.
it_it: Utilizzare la palette di sinistra per trascinare e rilasciare i container e i widget con la whiteboard.

source: User id could then be obtained by using {{youVar.user_id}}
it_it: L'Id dell'utente potrebbe essere ottenuto utilizzando {{youVar.user_id}}

source: Value
it_it: Valore

source: Value max length
it_it: Lunghezza massima del valore

source: Value min length
it_it: Lunghezza minima del valore

source: Value must be unique
it_it: Il valore deve essere unico

source: Value to add
it_it: Valore da aggiungere

source: Variable in read-write binding with the property value
it_it: Variabile in associazione di lettura-scrittura con il valore della proprietà

source: Variable names must start with a letter and contain only alphanumeric characters
it_it: I nomi delle variabili devono iniziare con una lettera e contenere solo caratteri alfanumerici

source: Variables
it_it: Variabili

source: Variables can be bound to input fields to create conditional behavior between widget properties.
it_it: Le variabili possono essere associate a campi di input per creare un comportamento condizionale tra proprietà dei widget.

source: View asset content
it_it: Visualizza contenuto degli asset

source: W3C website
it_it: Sito Web del W3C

source: When 'Content' is a list of objects, specifies the attributes to display in the table columns
it_it: Quando 'Content' è una lista di oggetti, specifica gli attributi da visualizzare nelle colonne della tabella

source: When you delete a row, the following rows move up
it_it: Quando si elimina una riga, le righe sottostanti verranno spostate verso l'alto

source: When you generate a form from a contract in the Studio, the form contains a Submit button and some default variables: <code>formInput</code>, <code>formOutput</code>, <code>taskId</code>, and <code>context</code>
it_it: Quando si genera un form da un contratto nello Studio, il form contiene un pulsante di invio e alcune variabili predefinite: <code>formInput</code>, <code>formOutput</code>, <code>taskId</code> e <code>context</code>

source: Where businessDataName is the name of the data variable defined on the pool.
it_it: Dove businessDataName è il nome della variabile dati definita sul pool.

source: Where businessDataType = com.company.model.MyData, queryName = name of the BDM query, filter = "myParam=myValue"
it_it: Dove businessDataType = com.company.model.MyData, nomequery = nome della query BDM, filtro = "myParam = myValue"

source: Widget Name
it_it: Nome del Widget

source: Widget description
it_it: Descrizione del Widget

source: Widget name should contains only alphanumeric characters with no space
it_it: Il nome della widget deve contiene solo caratteri alfanumerici senza spazi

source: Widget names must start with a letter and contain only alphanumeric characters
it_it: I nomi dei widget devono iniziare con una lettera e contenere solo caratteri alfanumerici

source: Widgets
it_it: Widget

source: Width
it_it: Larghezza

source: Within a row, when you delete a widget or a container, the following elements move to the left
it_it: All'interno di una riga, quando si elimina un widget o un container, gli elementi adiacenti verranno spostati verso sinistra

source: You can also create <b>custom widgets</b> from the home page.
it_it: È inoltre possibile creare <b>widget personalizzati</b> dalla home page.

source: You can group widgets into a container to define the arrangement of widgets in a form or a page. A container can contain other containers.
it_it: È possibile raggruppare i widget in un container per definire la disposizione dei widget in un form o in una pagina. Un container può contenere altri container.

source: You can import an existing page, form, or layout to edit, or duplicate existing ones
it_it: È possibile importare una pagina esistente, un form o un layout per modificare o duplicare quelli esistenti

source: You can save the content of a plain container as a reusable fragment.
it_it: È possibile salvare il contenuto di un container come un frammento riutilizzabile.

source: You can translate all the text displayed on a page or form: the labels, the placeholders, the available values of a list, but also the date format of the DatePicker widget. The base language is en_US. The phrases in English are used as the keys to the translated phrases. This means that in the Page editor whiteboard, any default text that is created is in English. The rest of the UI designer, including properties, is in the language of your Bonita BPM Studio. When you preview a page that has translated keys, the language of your browser is used.
it_it: È possibile tradurre tutto il testo visualizzato in una pagina o in un form: le etichette, i segnaposto, i valori disponibili di una lista, e anche il formato delle date del widget DatePicker. La lingua di base è en_US. Le frasi in inglese vengono utilizzate come chiavi per le frasi tradotte. Questo significa che nell' editor della pagina qualsiasi testo predefinito che viene creato sarà in inglese. Il resto dell' UI designer, comprese le proprietà, è nella lingua del vostro Bonita BPM Studio. Quando si cerca di visualizzare una pagina in anteprima essa verrà tradotta basandosi sulla lingua del navigatore che si sta utlizzando.

source: You cannot have more than one localization asset. When you upload a new asset file, it overwrites the existing one.
it_it: Non si puo' avere più di una risorsa di localizzazione. Quando si carica una nuova risorsa, questa sovrascriverà quella esistente.

source: You can’t manually change the order of assets in a page.
it_it: È possibile modificare manualmente l'ordine degli asset in una pagina.

source: You have unsaved changes. Do you really want to leave ?
it_it: Alcune delle modifiche non sono state ancora salvate. Si desidera chiudere ugualmente ?

source: added
it_it: aggiunto

source: center
it_it: centro

source: column
it_it: colonna

source: custom widgets
it_it: Widget personalizzati

source: default
it_it: predefinito

source: email
it_it: Indirizzo e-mail

source: error
it_it: errore

source: expression or variable
it_it: variabile o espressione

source: filter:
it_it: filtro:

source: green,red,blue
it_it: verde, rosso, blu

source: hidden
it_it: nascosto

source: label Hidden
it_it: Etichetta nascosta

source: left
it_it: sinistra

source: name
it_it: nome

source: number
it_it: numero

source: overridden
it_it: sostituito

source: right
it_it: destra

source: successfully
it_it: con successo

source: supportTicket is an object composed of a <em>subject</em>, <em>severity</em> level, user <em>environment</em>, reporter’s <em>contact</em> (<em>name</em> and <em>job title</em>), and an <em>URL</em> providing more details on the contact.
it_it: supportTicket è un oggetto composto da un <em>soggetto</em>,un livello di <em>gravità</em>, un utente <em>ambiente</em>, un <em>contatto</em> del reporter ( <em>nome</em> e <em>titolo di lavoro</em>) e un <em>URL</em> per fornire maggiori informazioni sul contatto.

source: text
it_it: testo

source: top
it_it: In alto

source: view W3C's Json specification
it_it: Visualizza le specifiche del W3C Json

source: widgets
it_it: widget

source: y: year, M: month, d: day, h: hour, m: minute, s: second
it_it: y: anno, m: mese, d: giorno, h: ore, m: minuti, s: secondi

source: yes
it_it: Si

source: yes,no
it_it: sì, no

source: {{asset.name}} content
it_it: {{asset.name}} contenuto
