Repository: AhmedJardak/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: it_it

source: '{{newData.$$name}}' already exists
it_it: '{{newData.$$name}}' già esistente

source: (displayed in editor's property panel)
it_it: (visualizzato nel pannello Proprietà dell'editor)

source: (used in your template and controller)
it_it: (usato nel tuo modello e controller)

source: <b>To use a form in a process</b>, map it in the studio to the relevant process or human task. It will be automatically packaged in the .bar archive ready to deploy in the portal.
it_it: <b>Per usare un form in un processo</b>, mapparlo nello studio con il processo o il task corrispondente. Questo sarà automaticamente pubblicato nell' archivio .bar pronto per essere usato nel portale.

source: <b>To use a layout in a business application</b>, export it from the UI Designer, import it into the portal as a resource and map it as the layout of the relevant application.
it_it: <b>Per usare un layout in un'applicazione aziendale</b>, esportarlo dall'UI designer, importarlo nel portale come una risorsa e mapparlo come layout all'applicazione corrispondente.

source: <b>To use a page in a business application</b>, export it from the UI Designer, import it into Bonita BPM Portal resources, and from the relevant application, add it to the list of pages and to a navigation menu.
it_it: <b>Per utilizzare una pagina in un'applicazione aziendale</b>, esportarla dall'UI designer, importarla come risorsa nel portale e aggiungerla alla lista delle pagine dell'applicazione corrispondente.

source: <code>context</code> is an External API. <br>It provides references to all business variables and documents in the process instance. To retrieve a business variable instance, create an External API variable with value <ng-non-bindable>../{{context.myBusinessData_ref.link}}</ng-non-bindable>
it_it: Il <code>context</code> è un API. esterna <br> che fornisce i riferimenti a tutte le variabili business e ai documenti definiti nell'istanza del processo. Per recuperare l'istanza di una variabile business, è necessario creare una variabile di API esterna con valore <ng-non-bindable>... /{{context.myBusinessData_ref.link}} </ng-non-bindable>

source: <code>formInput</code> is a JSON object. <br>Its structure is defined by the contract inputs and the attributes are initialized with default values. It could be used to set initial values for form fields. <br>You can set the values in <code>formInput</code> either by editing the default values with constants (useful for test and debug) or with values from an object in an external source that has the same model (such as with a BDM external API). <br>You can also set the initial values of a form from some other source without using <code>formInput</code>. However, you will then have to edit <code>formOutput</code> manually.
it_it: <code>formInput</code> è un oggetto JSON. <br>la sua struttura è definita dagli input del contratto e dagli attributi che vengono inizializzati con dei valori predefiniti. Puo' essere utilizzato per impostare i valori iniziali del form <br>E' possibile impostare i valori in <code>formInput</code> modificando i valori predefiniti con delle costanti (utile per test e debug) o con dei valori di un oggetto recuperato da una fonte esterna che ha lo stesso modello (come un API BDM). <br>E' anche possibile impostare i valori iniziali di un form da un'altra origine senza utilizzare <code>formInput</code>. In tal caso, sarà necessarion modificare <code>formOutput</code> manualmente.

source: <code>formOutput</code> is a JavaScript expression returning an object. <br>Its structure matches the contract requirements and is filled with <code>formInput</code> by default. Its goal is to aggregate the fields from the form and to submit them to the task or process to fulfil the contract. On Submit, values entered or modified by the end-user and aggregated in the <code>formOutput</code> object (as defined by the <i>Data sent on click</i> property of the Submit button) and submitted to the process or task
it_it: <code>formOutput</code> è un'espressione di JavaScript che restituisce un oggetto. <br>la sua struttura soddisfa i requisiti del contratto, i cui valori predefiniti vengono forniti da <code>formInput</code>. Il suo obiettivo è di aggregare i valodi dei campi del from ed inviarli al task o al processo al fine di adempiere al contratto. Su Invia, i valori immessi o modificati dall'utente vengono aggregati nell'oggetto <code>formOutput</code> (come definito dalla proprietà <i>dati inviati al click</i> del pulsante Invia) e inviati al processo o al task in corso

source: <code>taskId</code> is a URL Parameter. <br>It is the id of the current BPM task. You can use it as a BPM API parameter.
it_it: <code>taskId</code> è un parametro URL. <br>E' l'id del task corrente. E' possibile usarlo come come parametro di una API BPM.

source: <span class="tip">Tip:</span> Array syntax: ["val1", "val2"], Object syntax: {"key": "value"}
it_it: <span class="tip"> Suggerimento:</span> Sintassi dell'array: ["val1", "val2"], Sintassi dell'oggetto: {"key": "value"}

source: <span class="tip">Tip:</span> Hit <span class="key">$</span> key to access data, use ctrl-space to trigger autocomplete.
it_it: <span class="tip"> Suggerimento:</span> Premere il tasto <span class="key"> $</span> per accedere alle variabili, premere ctrl-spazio per attivare il completamento automatico.

source: <span class="tip">Tip:</span> URL parameters are located after a <em>?</em> in the page URL.
it_it: <span class="tip"> Suggerimento:</span> I parametri dell URL si trovano dopo un <em>?</em> nell'URL della pagina.

source: <span class="tip">Tip:</span> You can use data in the URL, by using the syntax <em ng-non-bindable="">{{dataName}}</em>
it_it: <span class="tip"> Suggerimento:</span> È possibile utilizzare i dati nell'URL, usando la sintassi <em ng-non-bindable="">{{dataName}}</em>

source: A binding is dynamic, so every time data changes, the whole data model is re-evaluated and the UI is updated.
it_it: Un'associazione è dinamica, quindi ogni volta che i dati vengono modificati, l'intero modello di dati viene rivalutato e l'interfaccia utente aggiornata.

source: A local asset name must not contain special characters or spaces. An external asset name must be a standard URL.
it_it: Un nome di risorsa locale non deve contenere spazi o caratteri speciali. Un nome di risorsa esterna deve essere un URL standard.

source: A property that requires a constant value is presented in the Properties panel as a radio button set, drop-down list, or number selector (for the Width property). Select the required value.
it_it: Una proprietà che richiede un valore costante è presentata nel pannello Proprietà come un radio button , un elenco a discesa o un selettore numero (per la proprietà Width). Selezionare il valore desiderato.

source: A property value is constant, dynamic, a bidirectional bond, or an interpolation.
it_it: Il valore di una proprietà puo' essere costante, dinamico, un legame bidirezionale, o un'interpolazione.

source: API URL
it_it: URL dell'API

source: Access to $form capabilities for form container
it_it: Accedi alle funzionalità di $form per il container del form

source: Action
it_it: Azione

source: Active
it_it: Attivo

source: Add
it_it: Aggiungi

source: Add CSS assets at page level and use them to edit the CSS classes property of any widget. (UI Designer integrates default Bootstrap style)
it_it: Aggiungere degli asset di tipo CSS a livello della pagina e utilizzarli per modificare le proprietà di classi CSS di qualsiasi widget. (UI Designer integra lo stile predefinito di Bootstrap)

source: Add JavaScript assets for custom scripts. They will be loaded and made available at page level. You can use them in variables of type JavaScript expression. In the value field of the variable, simply call the function and pass the required parameters.
it_it: Aggiungere degli asset JavaScript per gli script personalizzati. Saranno caricati e messi a disposizione a livello pagina. È possibile utilizzarli in variabili di tipo espressione JavaScript. Nel valore della variabile, è sufficiente chiamare la funzione e passargli i parametri necessari.

source: Add a new asset
it_it: Aggiungere un nuovo asset

source: Add a new tab
it_it: Aggiungi un nuovo tab

source: Add images, CSS or JavaScript resources to your pages in the Assets panel at the bottom.
it_it: Aggiungere immagini, risorse CSS o JavaScript alle tue pagine nel pannello degli asset nella parte inferiore.

source: Add to collection
it_it: Aggiungere alla collezione

source: Added artifacts
it_it: Aggiunta degli artefatti

source: Alignment
it_it: Allinemento

source: All process data of a case: Search for a list of case variables
it_it: Tutti i dati di un caso di processo: ricercare una lista di variabili di un caso

source: Alternate text
it_it: Testo Alternativo

source: Any accessible CSS classes. By default UI Designer comes with Bootstrap http://getbootstrap.com/css/#helper-classes
it_it: Qualsiasi classe CSS accessibile. Come impostazione predefinita l'UI Designer è basato su Bootstrap http://getbootstrap.com/css/#helper-classes

source: Apply a filter to the value of a variable: <em>selectedUser | json</em>
it_it: Applicare un filtro per il valore di una variabile: <em>selectedUser | json</em>

source: Are you sure you want to delete the {{ artifact.type }} <b>{{ artifact.name }}</b>?
it_it: Si è sicuri di voler eliminare il {{ artifact.type }} <b>{{ artifact.name }}</b>?

source: Array used to populate the table. Can be a list of objects. Use 'Column keys' to refine content
it_it: Array utilizzato per popolare la tabella. Può essere un elenco di oggetti. Utilizzare 'Chiavi delle colonne ' per raffinare il contenuto

source: Asset Name
it_it: Nome dell'asset

source: Asset list
it_it: Lista degli asset

source: Asset use
it_it: Uso degli asset

source: Assets
it_it: Risorse

source: Assets enable you to add web resources to pages and forms. Available asset types are <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>Image</strong> and (in Subscription editions) <strong>Localization</strong>. Assets can be <strong>Local</strong> (file stored into the page artifact) or External (URL). The Localization asset is always local.
it_it: Gli asset consentono di aggiungere risorse web alle pagine e ai form. I tipi di asset disponibili sono <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>Immagini</strong> e (nelle versioni in abbonamento) <strong>localizzazione</strong>. Gli asset possono essere <strong>Locale</strong> (file memorizzato nell'artefatto della pagina) o Esterno (URL). L'asset di localizzazione è sempre locale.

source: At runtime, assets of a custom widget are loaded in the order defined.
it_it: In fase di esecuzione, gli asset di un widget personalizzato vengono caricati nell'ordine specificato.

source: At runtime, custom widget assets are loaded in alphabetical order of the custom widgets. For each custom widget, the assets are loaded in the order they are listed. Then page assets are loaded. JavaScript and CSS assets are loaded in the page header.
it_it: In fase di esecuzione, gli asset del widget personalizzato vengono caricati in ordine alfabetico. Per ogni widget personalizzato, gli asset vengono caricati nell'ordine in cui sono elencati. Quindi gli asset della pagina vengono caricate. Gli asset di tipo JavaScript e CSS vengono caricati nell'header della pagina.

source: Available values
it_it: Valori disponibili

source: Available variables types are string and JSON (static), and External API, JavaScript expression, and URL parameter (dynamic).
it_it: I tipi di variabile a disposizione sono String e JSON (statici) , API esterne, espressioni JavaScript et parametri dell'URL (dinamici).

source: Bidirectional bond
it_it: Legame bidirezionale

source: Bind this property to a variable of type array. For each iteration, a widget property can be bound to $item to access the current JavaScript object
it_it: Associare questa proprietà a una variabile di tipo array. Ad ogni iterazione, una proprietà di widget può essere associata a $item per accedere all'attuale oggetto JavaScript

source: CSS classes
it_it: Classi CSS

source: Calendar for selecting a date
it_it: Calendario per la selezione di una data

source: Call a business data (custom) query
it_it: Chiamare una query (personalizzata) di dati business

source: Can be a list of objects. Use 'Displayed key' to refine options and 'Returned key' to refine selections
it_it: Può essere un elenco di oggetti. Usare 'Chiave visualizzata' per affinare le opzioni e 'Chiave restituita' per raffinare le selezioni

source: Can be a list of objects. Use 'Displayed key' to refine suggestions
it_it: Può essere un elenco di oggetti. Usare 'Chiave visualizzata' per perfezionare i suggerimenti

source: Can be a list of objects. Use 'Displayed key' to refine suggestions and 'Returned key' to refine selection
it_it: Può essere un elenco di oggetti. Usare 'Chiave visualizzata' per raffinare i suggerimenti e 'Chiave restituita' per raffinare le selezioni

source: Can be used to fulfill a contract
it_it: Può essere utilizzato per soddisfare un contratto

source: Cancel
it_it: Annulla

source: Case identifier could then be retrieved by {{myVar.rootCaseId}}
it_it: L'ID di un caso puo' essere ritrovato in seguito da {{myVar.rootCaseId}}

source: Choices
it_it: Scelte

source: Choices (comma separated)
it_it: Scelte (separate da delle virgole)

source: Clear filter
it_it: Rimuovere il filtro

source: Click to bind to a constant
it_it: Fare clic per associare a una costante

source: Click to bind to an expression
it_it: Fare clic per eseguire l'associazione ad un'espressione

source: Close
it_it: Chiudi

source: Collection
it_it: Collezione

source: Column keys
it_it: Chiavi delle colonne

source: Comma-separated list
it_it: Elenco delimitato da virgole

source: Comma-separated list or bound an array data
it_it: Elenco delimitato da virgole o da associare ai dati di una matrice

source: Configure widgets using the <b>properties panel</b> on the right.
it_it: Configurare i widget utilizzando il <b>pannello delle proprietà</b> sulla destra.

source: Confirm deletion
it_it: Conferma l'eliminazione

source: Constant
it_it: Costante

source: Container used for a form. Eases validation
it_it: Container utilizzato da un form. Facilita la convalida

source: Containers
it_it: Container

source: Content
it_it: Contenuto

source: Create
it_it: Crea

source: Create <b>pages</b> directly in the UI Designer
it_it: Creare le <b>pagine</b> direttamente nell'UI designer

source: Create a JSON variable named <code>updateDate</code> to hold a timestamp as a number
it_it: Creare una variabile JSON denominata <code>updateDate</code> per contenere un timestamp numerico

source: Create a JavaScript file named <code>date-ago-filter.js</code> that updates the <code>bonitasoft.ui.extensions</code> module with the filter:
it_it: Creare un file JavaScript denominato <code>date-ago-filter.js</code> che aggiorna il modulo <code>bonitasoft.ui.extensions</code> con il filtro:

source: Create a fragment to reuse the same group of widgets with the same behavior in several pages or forms.
it_it: Creare un frammento per riutilizzare lo stesso gruppo di widget con lo stesso comportamento in più pagine o form.

source: Create a new variable
it_it: Creare una nuova variabile

source: Create a variable here. To bind it to a widget property, first click on the <i>Bind</i> button in the property field and then type the variable name.
it_it: Creare una variabile qui. Per associarla ad una proprietà di widget, fare clic prima sul pulsante <i>Associare</i> nelle proprietà del campo e in seguito digitare il nome della variable .

source: Create a variable in the bottom panel. To bind it to a widget property, click on the “Bind” button in the property field and then type the variable name.
it_it: Creare una variabile nel pannello inferiore. Per associarla ad una proprietà di un widget, cliccare sul pulsante "Associare" nelle proprietà del campo e quindi digitare il nome della variabile .

source: Create layouts by duplicating the default layout available in the Bonita BPM Portal resources
it_it: Creare un layout duplicando il layout di default disponibile nelle risorse del portale

source: Create new page
it_it: Creare une nuova pagina

source: Create new property
it_it: Creare una nuova proprietà

source: Create new widget
it_it: Creare un nuovo widget

source: Create variables in the Variables panel at the bottom, and use them to edit the widget properties.
it_it: Creare le variabili nel pannello variabili nella parte inferiore e usali per modificare le proprietà dei widget.

source: Custom Widgets
it_it: Widget personalizzati

source: Custom services
it_it: Servizi personalizzati

source: Custom widget [ {{name}} ] successfully saved
it_it: Widget personalizzato [ {{name}} ] salvato correttamente

source: Custom widget editor
it_it: Editor di widget personalizzati

source: Data sent on click
it_it: Dati inviati sul clic

source: Date
it_it: Data

source: Date format
it_it: Formato della data

source: Default
it_it: Predefinito

source: Default label
it_it: Etichetta predefinita

source: Default name
it_it: Nome predefinito

source: Default value
it_it: Valore predefinito

source: Default variables
it_it: Variabili predefinite

source: Define a condition for widget visibility, <em>userAge &gt; 18</em>
it_it: Definire una condizione per la visibilità del widget, <em>userAge > 18</em>

source: Define table headers as the value of a variable: <em>myArrayVariable</em>
it_it: Definire le intestazioni della tabella come il valore di una variabile: <em>myArrayVariable</em>

source: Defines endpoint URL where the file will be uploaded
it_it: Definisce l'URL da cui verrà caricato il file

source: Delete
it_it: Cancella

source: Delete asset
it_it: Eliminare l'asset

source: Delete page
it_it: Cancella questa pagina

source: Delete variable
it_it: Eliminare la variabile

source: Delete widget
it_it: Eliminare il widget

source: Deletion is not possible
it_it: La cancellazione non è possibile

source: Description
it_it: Descrizione

source: Disabled
it_it: Disabilitato

source: Display an image from assets or from a URL
it_it: Visualizza un'immagine da una risorsa o da un URL

source: Displayed key
it_it: Chiave visualizzata

source: Drag and drop widgets or containers in rows
it_it: Drag and drop dei widget o dei container nella riga

source: Dropdown list of available values. The user selects one value
it_it: Elenco a discesa dei valori disponibili. L'utente seleziona un valore

source: Dynamic value
it_it: Valore dinamico

source: Each page has a localization asset that contains the keys and the translations for all phrases and all languages that the page supports. The asset is a file, localization.json. Each language is identified by the ISO 639 language attribute (for example, fr-FR, es-ES). Open the default localization.json asset to see how this file must be formatted. You can modify the default asset for your page, or import a new asset to replace the default one.
it_it: Ogni pagina ha un asset di localizzazione che contiene le chiavi e le traduzioni per tutte le frasi e tutte le lingue supportate dalla pagina. L'asset è un file, localization.json. Ogni lingua è identificata dall'attributo lingua ISO 639 (ad esempio, fr-FR, es-ES). Se si vuole avere un esempio di come questo asset deve essere formattato si consiglia di aprire l'asset predefinito localization.json. E' possibile modificare l'asset predefinito per la propria pagina, o importare un nuovo asset per sostituire quello di default.

source: Each type or container has sepcific behaviors
it_it: Ogni tipo o container presenta comportamenti sepcifici

source: Edit asset
it_it: Modificare l'asset

source: Edit property
it_it: Modifica proprietà

source: Edit the custom widget
it_it: Modificare il widget personalizzato

source: Edit variable
it_it: Modifica variabile

source: Editor organization
it_it: Organizzazione dell' editor

source: Enter ' + mode + ' name
it_it: Immettere ' + mode + ' nome

source: Example: relative time filter
it_it: Esempio: filtro di tempo relativo

source: Export
it_it: Esporta

source: Export page
it_it: Esportare la pagina

source: Export widget
it_it: Esportare il widget

source: Exposed
it_it: Esposti

source: External
it_it: Esterno

source: External API
it_it: API esterna

source: Extra angular modules needed by this custom widget (comma separated)
it_it: Moduli esterni ad angular necessari a questo widget personallizzato (separati da virgola)

source: Failed response value
it_it: Valore della risposta in caso di errore

source: Field where the user can enter information
it_it: Campo dove l'utente può immettere informazioni

source: File chooser for uploading a document to a form
it_it: Seleziona un file per il caricamento di un documento in un form

source: First
it_it: Primo

source: General
it_it: Generale

source: Get a case by its identifier
it_it: Ottenere un caso dal relativo ID

source: Get a human task by its identifier
it_it: Ottenere un task umano dal relativo ID

source: Get a named business data reference defined in a case
it_it: Ottenere un riferimento ad un business data specificato in un caso

source: Get all business data references defined in a case
it_it: Ottenere tutti i riferimenti ai business data definiti in un caso

source: Get current logged user
it_it: Ottenere l'utente attualmente connesso

source: Get custom information of a user
it_it: Ottenere le informazioni personalizzate di un utente

source: Get professional details of a user
it_it: Ottenere i dettagli professionali di un utente

source: Group of widgets used to define the arrangement of the page elements. Its content can be repeated over an array
it_it: Un gruppo di widget è usato per definire la disposizione degli elementi nella pagina. Il contenuto può essere ripetuto su un array

source: Headers
it_it: Intestazioni

source: Help
it_it: Aiuto

source: Hidden
it_it: Nascosto

source: Holds the response from the upload endpoint. That value can be used to fulfill a contract
it_it: Contiene la risposta ricevuta dall'endpoint di caricamento. Tale valore può essere utilizzato per soddisfare un contratto

source: Holds the response when the request has failed
it_it: Contiene la risposta quando la richiesta ha esito negativo

source: Holds the response when the request is successful
it_it: Contiene la risposta quando la richiesta ha esito positivo

source: Id,Name,Description,Date
it_it: Id, Nome, Descrizione, Data

source: If you specify an expression, the result must be an array of strings
it_it: Se si specifica un'espressione, il risultato deve essere un array di stringhe

source: Import
it_it: Importa

source: Import a page or a form
it_it: Importare una pagina o un formulario

source: Import a widget
it_it: Importare un widget

source: Import the moment.js library as an external asset.
it_it: Importare la libreria moment.js come un asset esterno.

source: Import this JavaScript file as a local page asset.
it_it: Importare questo file JavaScript come un asset locale della pagina.

source: In a JavaScript asset, you can specify a dependency on an Angular module. First add the JavaScript asset, and then add the module name in the dedicated section. You can find the the available modules on <a href="http://ngmodules.org/">http://ngmodules.org/</a>.
it_it: In un asset di tipo JavaScript, è possibile specificare una dipendenza su un modulo angular. Prima di tutto bisogna aggiungere l'asset JavaScript e in seguito specificare il nome del form nella sezione dedicata. È possibile trovare i moduli disponibili su <a href="http://ngmodules.org/"> http://ngmodules.org/</a>.
