Repository: AhmedJardak/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: it_it

source: In production, if the user is logged in to Bonita BPM, pages are displayed in the Portal language selected by the user, or in the default Portal language.
it_it: In produzione, se l'utente è connesso a Bonita BPM, le pagine vengono visualizzate nella lingua impostata nel portale , o nella lingua predefinita.

source: In the context of a form container, use $form.$invalid as a Boolean to check form validity in a widget property
it_it: Nel contesto di un form container, utilizzare $form.$invalid come un valore Boolean per controllare la validità del form in una proprietà di widget

source: In the fragment editor, you can set the scope of a variable to <i>specific to this fragment</i> or to <i>exposed to the page</i>.
it_it: Nell'editor di frammenti, è possibile impostare la visibilità di una variabile <i>specifica a questo frammento</i> o <i>esposta alla pagina</i>.

source: In the list, you can delete page assets only, view local assets, and edit external assets of a page.
it_it: Nell'elenco, si possono eliminare solo gli asset della pagina, visualizzare gli asset locali e modificare gli asset esterni.

source: In the scope of a page, form, or layout, a variable can be used to handle business data or process data, or can contain structural information that determines how page elements behave.
it_it: Nell'ambito di una pagina, un form o un layout, una variabile può essere utilizzata per gestire i dati aziendali o elaborare i dati, o può contenere informationi strutturali che determinano come si comportano gli elementi della pagina.

source: In the scope of a page, form, or layout, a variable can be used to handle business data or process data, or can contain structural information that determines how page elements behave.
it_it: Nell'ambito di una pagina, un form o un layout, una variabile può essere utilizzata per gestire i dati aziendali o elaborare i dati, o può contenere informationi strutturali che determinano come si comportano gli elementi della pagina.

source: In this list, you can use the arrows to reorder assets, view local assets, edit external assets, and delete any.
it_it: In questo elenco, è possibile utilizzare le frecce per riordinare gli asset, visualizzare gli asset locali, modificare gli asset esterni e supprimere gli asset che non più necessari.

source: Inline
it_it: In linea

source: Input field with content completion from a given list
it_it: Campo di input con suggerimenti a partire da una lista di dati

source: Integration with Bonita BPM platform
it_it: Integrazione con la piattaforma di Bonita BPM

source: Interpolation
it_it: Interpolazione

source: Invalid URL (must start by http:// or https://)!
it_it: URL non valido (deve iniziare con http:// o https://)!

source: Item
it_it: Elemento

source: Item to remove
it_it: Elemento da rimuovere

source: JSON specifications can be found on the
it_it: Le specifiche JSON possono essere trovate sul

source: Javascript expression
it_it: Espressione JavaScript

source: Label
it_it: Etichetta

source: Label hidden
it_it: Etichetta nascosta

source: Label position
it_it: Posizione dell'etichetta

source: Label width
it_it: Larghezza dell'etichetta

source: Last
it_it: Ultimo

source: Level 1
it_it: Livello 1

source: Level 2
it_it: Livello 2

source: Level 3
it_it: Livello 3

source: Level 4
it_it: Livello 4

source: Level 5
it_it: Livello 5

source: Level 6
it_it: Livello 6

source: List of cases open for a process definition id
it_it: Elenco dei casi in corso per un id di definizione di processo

source: List of human task in ready state for current user (pending + assigned)
it_it: Elenco delle task umane in stato ready per l'utente corrente (in sospeso + assegnate)

source: Local
it_it: Locale

source: Localization
it_it: Localizzazione

source: London,Paris,San Francisco
it_it: Londra, Parigi, San Francisco

source: MM/dd/yyyy
it_it: dd/MM/yyyy

source: Max value
it_it: Valore massimo

source: Min value
it_it: Valore minimo

source: Move the row down
it_it: Sposta la riga verso il basso

source: Move the row up
it_it: Sposta la riga verso l'alto

source: Multi-line, expandable, text input field
it_it: Campo di input di testo multilinea, espandibile,

source: Multiple content for tabs container
it_it: Contenuto multiplo per i container di tab

source: Multiple groups of widgets, each group in a tab
it_it: Più gruppi di widget, ogni gruppo in una scheda

source: Must be a Boolean
it_it: Deve essere un valore booleano

source: Must be an array
it_it: Deve essere un vettore

source: Name
it_it: Nome

source: Navigation link to another page or form
it_it: Link di navigazione verso un'altra pagina o form

source: Neque porro quisquam est qui dolorem ipsum quia dolor sit amet,<br/>consectetur,<br/>adipisci velit...
it_it: Neque porro quisquam est dolorem ipsum quia dolor sit amet, <br/> consectetur, <br/> adipisci velit...

source: New page
it_it: Nuova pagina

source: New widget
it_it: Nuovo widget

source: No asset
it_it: Nessun asset

source: No custom widget
it_it: Nessun widget personalizzato

source: No page or form
it_it: Nessuna pagina o modulo

source: No variable
it_it: Nessuna variabile

source: Object key to display
it_it: Oggetto chiave da visualizzare

source: Once you select an element, edit its properties in the properties panel on the right.
it_it: Una volta che si seleziona un elemento, modificarne le proprietà nel pannello Proprietà sulla destra.

source: Open help
it_it: Aprire l'aiuto in linea

source: Overridden artifacts
it_it: Sottoposto a l'override di artefatti

source: Overview
it_it: Recap

source: Page Name
it_it: Nome della pagina

source: Page level
it_it: Livello della pagina

source: Page name should contains only alphanumeric characters with no space
it_it: Il nome della pagina deve contiene solo caratteri alfanumerici senza spazi

source: Page names must start with a letter and contain only alphanumeric characters
it_it: I nomi delle pagine devono iniziare con una lettera e contenere solo caratteri alfanumerici

source: Pages &amp; Forms
it_it: Pagine &amp; Form

source: Preview
it_it: Anteprima

source: Preview - {{pageName}}
it_it: Anteprima - {{pageName}}

source: Properties
it_it: Proprietà

source: Property names must start with a letter and contain only alphanumeric characters
it_it: I nomi delle proprietà devono iniziare con una lettera e contenere solo caratteri alfanumerici

source: Read-only
it_it: Sola lettura

source: Relative time filter
it_it: Filtro di tempo relativo

source: Remove
it_it: Cancella

source: Remove from collection
it_it: Rimuovere dalla collezione

source: Remove tab
it_it: Rimuovere il tab

source: Rename page
it_it: Rinominare la pagina

source: Repeat content for the plain container
it_it: Ripetere il contenuto del container

source: Repeat contents
it_it: Ripetere il contenuto

source: Required
it_it: Obbligatorio

source: Required angular modules
it_it: Moduli angular necessari

source: Returned key
it_it: Chiave restituita

source: Row
it_it: Riga

source: Rows
it_it: Righe

source: Save
it_it: Salva

source: Save as ...
it_it: Salva con nome ...

source: Save {{page.name}} as...
it_it: Salvare {{page.name}} come...

source: Save {{widget.name}} as...
it_it: Salvare {{widget.name}} come...

source: Search
it_it: Ricerca

source: Search a list of cases based on search indexes
it_it: Cercare un elenco di casi basati sugli indici di ricerca

source: Select
it_it: Seleziona

source: Select an element on the whiteboard, then set its properties here
it_it: Selezionare un elemento sulla whiteboard, quindi impostarne le proprietà in questa area

source: Select an option
it_it: Selezionare un'opzione

source: Select your .zip file
it_it: Selezionare il file zip

source: Select your file
it_it: Seleziona il file

source: Selected Row
it_it: Riga selezionata

source: Selected Value
it_it: Valore selezionato

source: Selected values
it_it: Valori selezionati

source: Send data to this URL when the button is clicked
it_it: Inviare i dati a questo URL quando viene fatto clic sul pulsante

source: Set of buttons for mutually exclusive options. The user selects one option
it_it: Un insieme di pulsanti per le opzioni mutuamente esclusive. L'utente seleziona una opzione

source: Set of checkboxes for options. The user selects zero or more
it_it: Un insieme di checkbox per le opzioni. L'utente seleziona zero o più opzioni

source: Short hint that describes the expected value
it_it: Suggerimento che descrive il valore previsto

source: Short string or paragraph of text to be displayed. Can include HTML tags
it_it: Breve stringa o paragrafo di testo da visualizzare. Può includere tag HTML

source: Source
it_it: Fonte

source: Source Type
it_it: Tipo di fonte

source: Space-separated list
it_it: Elenco separato da spazi

source: Specifies an alternate text for an image. The text should describe the image if the image contains information or should be left empty if the image is only for decoration
it_it: Consente di specificare un testo alternativo per un'immagine. Il testo dovrebbe descrivere l'immagine se l'immagine contiene informazioni o dovrebbe essere lasciato vuoto se l'immagine è solo per decorazione

source: Specify the number of columns of the element. All elements can take up to 12 columns.
it_it: Specificare il numero di colonne dell'elemento. Tutti gli elementi possono prendere fino a 12 colonne.

source: Specify your own format
it_it: Specificare un formato personalizzato

source: Start <b>form</b> design in Bonita BPM Studio from the appropriate contract
it_it: Inzia la creazione di un <b>form</b> in Bonita BPM Studio partendo dal contratto appropriato

source: Start process
it_it: Avviare il processo

source: String
it_it: Stringa

source: Style
it_it: Stile

source: Submit
it_it: Riferisci

source: Submit task
it_it: Eseguire un task

source: Subscription edition
it_it: Versione in abbonamento

source: Successful import
it_it: Importo effettuato con successo

source: Successful response value
it_it: Valore della risposta in caso di successo

source: Tabular presentation of data from an array
it_it: Presentazione tabulare dei dati da un array

source: Target URL on success
it_it: URL di destinazione in caso di successo

source: Target Url
it_it: Url di destinazione

source: Template
it_it: Modello

source: Text
it_it: Testo

source: Text used to structure the page or form content
it_it: Testo utilizzato per strutturare il contenuto di una pagina o un form

source: That is the next location. In the case of an application built using the Bonita BPM Portal, combine your application URL with the page token
it_it: Indica la pagina che verrà visualizzata al termine dell'operazione. Nel caso di un'applicazione generata tramite il portale, sarà necessario creare tale URL combinando l'URL dell'applicazione con il token della pagina

source: The UI Designer generates <b>standard html application code, based on AngularJS</b>. Export pages if you want to further customize them in a different favorite web development environment.
it_it: L'UI designer genera <b>il codice tipico di un applicazione basata su AngularJs </b>. E' possibile esportare le pagine nel caso in cui si desideri personalizzarle ulteriormente nell'ambiente di sviluppo web preferito .

source: The list contains both page assets and the assets of the custom widgets used in this page.
it_it: L'elenco contiene sia gli asset della pagina sia gli asset dei widget personalizzati utilizzati in questa pagina.

source: The name of the key to use as label. Can be empty
it_it: Il nome della chiave da utilizzare come etichetta. Può essere lasciato vuoto

source: The name of the key to use as value. Leave it empty for whole object
it_it: Il nome della chiave da utilizzare come valore. Lasciarlo libero se si utilizza l'intero oggetto

source: The whiteboard is organized in <b>rows</b> that you can move up and down, or delete.
it_it: Il whiteboard è organizzato in <b>righe</b> che è possibile spostare verso l'alto o verso il basso. Naturalmente ogni riga puo' essere soppressa.

source: The {{ artifact.type }} cannot be deleted because it is used in:
it_it: Il {{ artifact.type }} non può essere eliminato perché è usato in:

source: There is a set of <b>standard widgets</b> for displaying information to and for gathering information from the end users. You can also create <b>custom widgets</b>.
it_it: L'UI designer propone un insieme di <b>widget standard</b> per scambiare informazioni con l'utente. È anche possibile creare <b>widget personalizzati</b>.

source: This description will be displayed as a tooltip in the palette
it_it: Questa descrizione verrà visualizzata come tooltip nella palette

source: This example uses the JSON example provided if you select the type JSON.<br> It looks for the string ‘Linux’ in the array <code>environment</code> of JSON object <code>supportTicket</code>
it_it: Questo esempio utilizza l'esempio JSON fornito nel caso in cui si seleziona il tipo JSON. <br>Cerca la stringa 'Linux' nell' array <code>environment</code> dell'oggetto JSON <code>supportTicket</code>

source: This filter uses the <a href="http://momentjs.com/">moment.js</a> library to transform the display of a relative time. For example, it transforms '01/01/2011' to '4 years ago'.
it_it: Questo filtro utilizza la libreria <a href="http://momentjs.com/">moment.js</a> per visualizzare una data in tempo relativo. Ad esempio, trasforma '01/01/2011' in '4 anni fa'.

source: This page is empty.
it_it: Questa pagina è vuota.

source: Title
it_it: Titolo

source: Title level
it_it: Livello del titolo

source: To add content, drag and drop components from the palette to the whiteboard above.
it_it: Per aggiungere un contenuto, trascinare e rilasciare i componenti dalla palette alla whiteboard.

source: To display the date in a widget property evaluated as an expression, use the <code>dateAgo</code> filter on the <code>updateDate</code> variable as follows: <code>updateDate | dateAgo</code>
it_it: Per visualizzare la data in una proprietà di widget valutata come un'espressione, utilizzare il filtro <code>dateAgo</code> sulla variabile <code>updateDate</code> come segue: <code>updateDate | dateAgo</code>

source: To extend a page or form with custom AngularJS services (such as filters, constants, or factories), use the <code>bonitasoft.ui.extensions</code> module.
it_it: Per estendere una pagina o un form con i servizi personalizzati di AngularJS (ad esempio filtri, costanti o factories), utilizzare il modulo <code>bonitasoft.ui.extensions</code>.

source: To load a local image asset in a custom widget, you need to reference it in the template inside a <code>&lt;img&gt;</code> tag with a relative path as follows: <br><code ng-non-bindable="">&lt;img src="widgets/[custom widget id]/assets/img/[image name]"&gt;</code>
it_it: Per caricare una risorsa locale di tipo immagine in un widget personalizzato, è necessario farvi riferimento nel modello all'interno di un tag <code>&lt;img&gt;</code> con un percorso relativo come segue: <br><code ng-non-bindable="">&lt;img src="widgets/[custom widget id]/assets/img/[image name]"&gt;</code>

source: To load an image for any custom widget, add image assets at page level. Access it with <code>asset/img/[image name]</code>.
it_it: Per caricare un'immagine per ogni widget personalizzato, è possibile aggiungere degli asset di tipo immagine a livello della pagina. Accedervi con <code>asset/img/[nome immagine]</code>.

source: To manage multiple version of dependencies, make sure only one version of an asset is active inside a page.
it_it: Per gestire più versioni delle dipendenze, assicurarsi che una singola versione di una stessa risorsa sia attiva all'interno di una pagina.

source: To update a form during production, export the form from the UI Designer, import it into the relevant process in the portal, and then map it to the relevant task or process start event.
it_it: Per aggiornare un form durante la produzione, esportare il form dalla finestra dell'UI designer, importarlo nel processo relativo nel portale, e quindi eseguirne il mapping con i task adeguati o con l'evento di inizializzazione del processo.

source: To use a localization asset, replace the default localization.json file with a file of the same format containing all the keys in the page and the translations into the target languages. The localization asset is at page level. The format of the file must be: <pre><code>{ "language-A with the format ISO 639-1 code": { "english key":"translated key for language-A", "english key2":"translated key2 for language-A", ... }, "language-B with the format ISO 639-1 code": { "english key":"translated key for language-B", "english key2":"translated key2 for language-B", ... } ... }</code></pre> See the default localization asset for an example.
it_it: Per utilizzare un asset di localizzazione, è necessario sostituire il file di localization.json predefinito con un file avente lo stesso formato contenente tutte le chiavi della pagina e le traduzioni nelle lingue di destinazione. L'asset di localization è a livello della pagina. Il formato del file deve essere: <pre><code>{ "lingua-A nel formato codice ISO 639-1": { "chiave inglese": "chiave tradotta per lingua-A", "chiave2 inglese": "chiave2 tradotta per lingua-A", ... }, "lingua-B nel formato codice ISO 639-1": { "chiave inglese": "chiave tradotta per lingua-B", "chiave2 inglese": "chiave2 tradotta per lingua-B", ... } ... }</code></pre> vedere l'asset di localizzazione predefinito per avere un esempio.

source: To use an image asset in the image widget, set the <code>Source type</code> property to <i>Asset</i>, and then enter the image name in the <code>Asset name</code> input field.
it_it: Per utilizzare una risorsa di tipo immagine nel widget immagine, impostare la proprietà <code>tipo origine</code> su <i>Asset</i> e quindi immettere il nome dell'immagine nel campo di immissione <code>nome dell'Asset</code>.

source: To use the same asset in several pages, you can add it to a custom widget and use this custom widget in your application pages or forms. When you add a custom widget with assets to a page, those assets are automatically linked to the page.
it_it: Per utilizzare lo stesso asset in diverse pagine, è possibile aggiungerlo ad un widget personalizzato e utilizzarlo in qualunque pagina dell'applicazione o form. Quando si aggiunge un widget personalizzato con gli asset di una pagina, tali asset vengono automaticamente legati alla pagina.

source: Toggle properties panel
it_it: Mostrare / Nascondere le proprietà

source: Treat as
it_it: Trattare come

source: Treat value as <span tooltip-template="'js/editor/help/description-bond-help.html'" class="fa fa-info-circle"></span>
it_it: Trattare il valore come <span tooltip-template="'js/editor/help/description-bond-help.html'" class="fa fa-info-circle"></span>

source: Trigger for an action in a page or form
it_it: Trigger per un'azione in una pagina o un form

source: Type
it_it: Tipo

source: UI designer includes a mechanism to add translations for page elements, to support multi-language pages. The text displayed in the preview and at runtime adapts to the locale or browser language automatically.
it_it: L'UI designer include un meccanismo per aggiungere le traduzioni agli elementi della pagina, per supportare pagine con più lingue disponibili. Il testo visualizzato in anteprima e in fase di esecuzione si adatta automaticamente alla lingua del navigatore o alla locale impostata.

source: URL parameter
it_it: Parametro URL

source: URL parameter name
it_it: Nome del parametro URL

source: URL to call
it_it: URL da chiamare

source: URL used to perform the HTTP request when this button is clicked.
it_it: URL che verrà utilizzato per eseguire la richiesta HTTP al clic su questo pulsante.

source: Unique checkbox for an option. The user checks it or not
it_it: Checkbox unico per una sola opzione possibile. L'utente sceglie se selezionarlo oppure no

source: Update asset
it_it: Aggiorna gli asset

source: Use $item as the current iteration.
it_it: Usare $item per accedere all'iterazione corrente.

source: Use $item to remove the current item in a repeated collection
it_it: Utilizzare $item per rimuovere l'elemento corrente in una collezione ripetuta

source: Use <b>widgets</b> from the palette on the left to <b>display information to</b> and <b>gather information from</b> the end users.
it_it: Utilizzare i <b>widget</b> dalla palette a sinistra per <b>presentare le informazioni agli</b> e <b>estrarre le informazioni dagli</b> utenti finali.

source: Use a bidirectional field to specify a read-write binding between the property value and a variable.
it_it: Utilizzare un campo bidirezionale per specificare un'associazione di lettura-scrittura tra il valore della proprietà e una variabile.

source: Use a dynamic value field to specify a constant (the default) or an expression. Click the expression icon fx to switch from constant to expression. Click the constant icon X to switch from expression to constant. An expression can include a variable to make the property value dynamic, or can simply be the name of a variable. You can apply a filter to a variable value using a pipe. The binding to the variable is a read. If you want to write to the variable, use a bidirectional bond. Examples:
it_it: Per specificare una costante (valore predefinito) o un'espressione, utilizzare un campo di valore dinamico. Fare clic sull'icona dell' espressione fx per passare da una costante all'espressione. Fare clic sull'icona costante X per passare da una espressione a una costante. Un'espressione può includere una variabile per rendere dinamico il valore della proprietà, o può semplicemente essere il nome di una variabile. È possibile applicare un filtro al valore di una variabile utilizzando un pipe. L'associazione ad una variable è in sola lettura. Se si desidera accedere alla variabile in scrittura, utilizzare una bond bidirezionale. Ad esempip:

source: Use an interpolation field to enter text to display in the widget. The text can include variables that are interpreted using AngularJS interpolation. When the page is displayed, the variables are replaced by the interpolated values. Specify a variable as a simple expression enclosed in double braces, using the same format as for a dynamic value field. Example: I'm sorry, <em ng-non-bindable="">{{ user.name | uppercase }}</em>. I'm afraid I can't do that.
it_it: Utilizzare un campo di interpolazione per immettere il testo da visualizzare nel widget. Il testo può includere variabili che vengono interpretate utilizzando l'interpolazione AngularJS. Quando la pagina viene visualizzata, le variabili sono sostituite dai valori interpolati. Specificare una variabile come una semplice espressione racchiusa tra parentesi graffe doppie, usando lo stesso formato come per un valore di campo dinamico Esempio: mi dispiace, <em ng-non-bindable="">{{ user.name | uppercase }}</em>. ma credo di non poterlo fare.

source: Use basic html tags and {{ dataVariable }} to access data
it_it: Utilizzare tag html di base e {{ dataVariable }} per accedere ai dati

source: Use the UI Designer to build <b>pages</b> for your business applications, <b>forms</b> to start process instances or execute human tasks, and <b>application layouts</b> that apply to all pages of an application.
it_it: Utilizzare l'UI designer per creare delle <b>pagine</b> per le applicazioni di business, dei <b>form</b> per istanziare un processo o per eseguire dei task umani e dei <b>layout di applicazione</b> che possono essere applicati a tutte le pagine di un'applicazione.
